{
  "auto-save.nvim": { "branch": "main" },
  "barbar.nvim": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "colorful-menu.nvim": { "branch": "master" },
  "flash.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "fzf-lua": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lazygit.nvim": { "branch": "main" },
  "lsp_signature.nvim": { "branch": "master" },
  "mason.nvim": { "branch": "main" },
  "mini.files": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-markdown-preview": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "rainbow-delimiters.nvim": { "branch": "master" },
  "smear-cursor.nvim": { "branch": "main" },
  "toggleterm.nvim": { "branch": "main" },
  "uv.nvim": { "branch": "main" },
  "vague.nvim": { "branch": "main" }
}
